               11 CHESHBON                 PIC X(5).
               11 SHEM                     PIC X(10).
               11 YITRA                    PIC S9(6)V99
                                           SIGN IS LEADING SEPARATE.
               11 TAARICH                  PIC X(8).
