             11 SHEM-KOVETZ                PIC X(50).
             11 SHEM-TUCHNIT               PIC X(40).
             11 SHEM-SEC                   PIC X(40).
